MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GB606/mcu.h
/* IOCPF */
/* Bitname _IOCPF0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF7 cannot be defined because it is used by more than one SFR */

/* IOCNF */
#define _IOCNF0 IOCNFbits.IOCNF0
#define _IOCNF1 IOCNFbits.IOCNF1
#define _IOCNF3 IOCNFbits.IOCNF3
#define _IOCNF4 IOCNFbits.IOCNF4
#define _IOCNF5 IOCNFbits.IOCNF5
#define _IOCNF7 IOCNFbits.IOCNF7

/* IOCFF */
#define _IOCFF0 IOCFFbits.IOCFF0
#define _IOCFF1 IOCFFbits.IOCFF1
#define _IOCFF3 IOCFFbits.IOCFF3
#define _IOCFF4 IOCFFbits.IOCFF4
#define _IOCFF5 IOCFFbits.IOCFF5
#define _IOCFF7 IOCFFbits.IOCFF7

/* CNPUF */
/* Bitname _IOCPF0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPF7 cannot be defined because it is used by more than one SFR */
#define _IOCPUF0 CNPUFbits.IOCPUF0
#define _IOCPUF1 CNPUFbits.IOCPUF1
#define _IOCPUF3 CNPUFbits.IOCPUF3
#define _IOCPUF4 CNPUFbits.IOCPUF4
#define _IOCPUF5 CNPUFbits.IOCPUF5
#define _IOCPUF7 CNPUFbits.IOCPUF7
#define _CNPUF0 CNPUFbits.CNPUF0
#define _CNPUF1 CNPUFbits.CNPUF1
#define _CNPUF3 CNPUFbits.CNPUF3
#define _CNPUF4 CNPUFbits.CNPUF4
#define _CNPUF5 CNPUFbits.CNPUF5
#define _CNPUF7 CNPUFbits.CNPUF7

/* CNPDF */
#define _IOCPDF0 CNPDFbits.IOCPDF0
#define _IOCPDF1 CNPDFbits.IOCPDF1
#define _IOCPDF3 CNPDFbits.IOCPDF3
#define _IOCPDF4 CNPDFbits.IOCPDF4
#define _IOCPDF5 CNPDFbits.IOCPDF5
#define _IOCPDF7 CNPDFbits.IOCPDF7
#define _CNPDF0 CNPDFbits.CNPDF0
#define _CNPDF1 CNPDFbits.CNPDF1
#define _CNPDF3 CNPDFbits.CNPDF3
#define _CNPDF4 CNPDFbits.CNPDF4
#define _CNPDF5 CNPDFbits.CNPDF5
#define _CNPDF7 CNPDFbits.CNPDF7

/* TRISG */
#define _TRISG2 TRISGbits.TRISG2
#define _TRISG3 TRISGbits.TRISG3
#define _TRISG6 TRISGbits.TRISG6
#define _TRISG7 TRISGbits.TRISG7
#define _TRISG8 TRISGbits.TRISG8
#define _TRISG9 TRISGbits.TRISG9

/* PORTG */
#define _RG2 PORTGbits.RG2
#define _RG3 PORTGbits.RG3
#define _RG6 PORTGbits.RG6
#define _RG7 PORTGbits.RG7
#define _RG8 PORTGbits.RG8
#define _RG9 PORTGbits.RG9

/* LATG */
#define _LATG2 LATGbits.LATG2
#define _LATG3 LATGbits.LATG3
#define _LATG6 LATGbits.LATG6
#define _LATG7 LATGbits.LATG7
#define _LATG8 LATGbits.LATG8
#define _LATG9 LATGbits.LATG9

/* ODCG */
#define _ODCG2 ODCGbits.ODCG2
#define _ODCG3 ODCGbits.ODCG3
#define _ODCG6 ODCGbits.ODCG6
#define _ODCG7 ODCGbits.ODCG7
#define _ODCG8 ODCGbits.ODCG8
#define _ODCG9 ODCGbits.ODCG9

/* ANSELG */
#define _ANSG6 ANSELGbits.ANSG6
#define _ANSG7 ANSELGbits.ANSG7
#define _ANSG8 ANSELGbits.ANSG8
#define _ANSG9 ANSELGbits.ANSG9
#define _ANSELG6 ANSELGbits.ANSELG6
#define _ANSELG7 ANSELGbits.ANSELG7
#define _ANSELG8 ANSELGbits.ANSELG8
#define _ANSELG9 ANSELGbits.ANSELG9

/* IOCPG */
/* Bitname _IOCPG2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG9 cannot be defined because it is used by more than one SFR */

/* IOCNG */
#define _IOCNG2 IOCNGbits.IOCNG2
#define _IOCNG3 IOCNGbits.IOCNG3
#define _IOCNG6 IOCNGbits.IOCNG6
#define _IOCNG7 IOCNGbits.IOCNG7
#define _IOCNG8 IOCNGbits.IOCNG8
#define _IOCNG9 IOCNGbits.IOCNG9

/* IOCFG */
#define _IOCFG2 IOCFGbits.IOCFG2
#define _IOCFG3 IOCFGbits.IOCFG3
#define _IOCFG6 IOCFGbits.IOCFG6
#define _IOCFG7 IOCFGbits.IOCFG7
#define _IOCFG8 IOCFGbits.IOCFG8
#define _IOCFG9 IOCFGbits.IOCFG9

/* CNPUG */
/* Bitname _IOCPG2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPG9 cannot be defined because it is used by more than one SFR */
#define _IOCPUG2 CNPUGbits.IOCPUG2
#define _IOCPUG3 CNPUGbits.IOCPUG3
#define _IOCPUG6 CNPUGbits.IOCPUG6
#define _IOCPUG7 CNPUGbits.IOCPUG7
#define _IOCPUG8 CNPUGbits.IOCPUG8
#define _IOCPUG9 CNPUGbits.IOCPUG9
#define _CNPUG2 CNPUGbits.CNPUG2
#define _CNPUG3 CNPUGbits.CNPUG3
#define _CNPUG6 CNPUGbits.CNPUG6
#define _CNPUG7 CNPUGbits.CNPUG7
#define _CNPUG8 CNPUGbits.CNPUG8
#define _CNPUG9 CNPUGbits.CNPUG9

/* CNPDG */
#define _IOCPDG2 CNPDGbits.IOCPDG2
#define _IOCPDG3 CNPDGbits.IOCPDG3
#define _IOCPDG6 CNPDGbits.IOCPDG6
#define _IOCPDG7 CNPDGbits.IOCPDG7
#define _IOCPDG8 CNPDGbits.IOCPDG8
#define _IOCPDG9 CNPDGbits.IOCPDG9
#define _CNPDG2 CNPDGbits.CNPDG2
#define _CNPDG3 CNPDGbits.CNPDG3
#define _CNPDG6 CNPDGbits.CNPDG6
#define _CNPDG7 CNPDGbits.CNPDG7
#define _CNPDG8 CNPDGbits.CNPDG8
#define _CNPDG9 CNPDGbits.CNPDG9

/* AD1CON1 */
#define _DONE AD1CON1bits.DONE
#define _SAMP AD1CON1bits.SAMP
#define _ASAM AD1CON1bits.ASAM
#define _SSRC AD1CON1bits.SSRC
#define _FORM AD1CON1bits.FORM
#define _MODE12 AD1CON1bits.MODE12
#define _DMAEN AD1CON1bits.DMAEN
#define _DMABM AD1CON1bits.DMABM
#define _ADSIDL AD1CON1bits.ADSIDL
#define _ADON AD1CON1bits.ADON
#define _SSRC0 AD1CON1bits.SSRC0
#define _SSRC1 AD1CON1bits.SSRC1
#define _SSRC2 AD1CON1bits.SSRC2
#define _SSRC3 AD1CON1bits.SSRC3
#define _FORM0 AD1CON1bits.FORM0
#define _FORM1 AD1CON1bits.FORM1

