MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GB606/mcu.h
#define _RPOR1_RP2R_POSITION                     0x00000000
#define _RPOR1_RP2R_MASK                         0x0000007F
#define _RPOR1_RP2R_LENGTH                       0x00000007

#define _RPOR1_RP3R_POSITION                     0x00000008
#define _RPOR1_RP3R_MASK                         0x00007F00
#define _RPOR1_RP3R_LENGTH                       0x00000007

#define _RPOR2_RP4R_POSITION                     0x00000000
#define _RPOR2_RP4R_MASK                         0x0000007F
#define _RPOR2_RP4R_LENGTH                       0x00000007

#define _RPOR3_RP6R_POSITION                     0x00000000
#define _RPOR3_RP6R_MASK                         0x0000007F
#define _RPOR3_RP6R_LENGTH                       0x00000007

#define _RPOR3_RP7R_POSITION                     0x00000008
#define _RPOR3_RP7R_MASK                         0x00007F00
#define _RPOR3_RP7R_LENGTH                       0x00000007

#define _RPOR4_RP8R_POSITION                     0x00000000
#define _RPOR4_RP8R_MASK                         0x0000007F
#define _RPOR4_RP8R_LENGTH                       0x00000007

#define _RPOR4_RP9R_POSITION                     0x00000008
#define _RPOR4_RP9R_MASK                         0x00007F00
#define _RPOR4_RP9R_LENGTH                       0x00000007

#define _RPOR5_RP10R_POSITION                    0x00000000
#define _RPOR5_RP10R_MASK                        0x0000007F
#define _RPOR5_RP10R_LENGTH                      0x00000007

#define _RPOR5_RP11R_POSITION                    0x00000008
#define _RPOR5_RP11R_MASK                        0x00007F00
#define _RPOR5_RP11R_LENGTH                      0x00000007

#define _RPOR6_RP12R_POSITION                    0x00000000
#define _RPOR6_RP12R_MASK                        0x0000007F
#define _RPOR6_RP12R_LENGTH                      0x00000007

#define _RPOR6_RP13R_POSITION                    0x00000008
#define _RPOR6_RP13R_MASK                        0x00007F00
#define _RPOR6_RP13R_LENGTH                      0x00000007

#define _RPOR7_RP14R_POSITION                    0x00000000
#define _RPOR7_RP14R_MASK                        0x0000007F
#define _RPOR7_RP14R_LENGTH                      0x00000007

#define _RPOR8_RP16R_POSITION                    0x00000000
#define _RPOR8_RP16R_MASK                        0x0000007F
#define _RPOR8_RP16R_LENGTH                      0x00000007

#define _RPOR8_RP17R_POSITION                    0x00000008
#define _RPOR8_RP17R_MASK                        0x00007F00
#define _RPOR8_RP17R_LENGTH                      0x00000007

#define _RPOR9_RP18R_POSITION                    0x00000000
#define _RPOR9_RP18R_MASK                        0x0000007F
#define _RPOR9_RP18R_LENGTH                      0x00000007

#define _RPOR9_RP19R_POSITION                    0x00000008
#define _RPOR9_RP19R_MASK                        0x00007F00
#define _RPOR9_RP19R_LENGTH                      0x00000007

#define _RPOR10_RP20R_POSITION                   0x00000000
#define _RPOR10_RP20R_MASK                       0x0000007F
#define _RPOR10_RP20R_LENGTH                     0x00000007

#define _RPOR10_RP21R_POSITION                   0x00000008
#define _RPOR10_RP21R_MASK                       0x00007F00
#define _RPOR10_RP21R_LENGTH                     0x00000007

#define _RPOR11_RP22R_POSITION                   0x00000000
#define _RPOR11_RP22R_MASK                       0x0000007F
#define _RPOR11_RP22R_LENGTH                     0x00000007

#define _RPOR11_RP23R_POSITION                   0x00000008
#define _RPOR11_RP23R_MASK                       0x00007F00
#define _RPOR11_RP23R_LENGTH                     0x00000007

#define _RPOR12_RP24R_POSITION                   0x00000000
#define _RPOR12_RP24R_MASK                       0x0000007F
#define _RPOR12_RP24R_LENGTH                     0x00000007

#define _RPOR12_RP25R_POSITION                   0x00000008
#define _RPOR12_RP25R_MASK                       0x00007F00
#define _RPOR12_RP25R_LENGTH                     0x00000007

#define _RPOR13_RP26R_POSITION                   0x00000000
#define _RPOR13_RP26R_MASK                       0x0000007F
#define _RPOR13_RP26R_LENGTH                     0x00000007

#define _RPOR13_RP27R_POSITION                   0x00000008
#define _RPOR13_RP27R_MASK                       0x00007F00
#define _RPOR13_RP27R_LENGTH                     0x00000007

#define _RPOR14_RP28R_POSITION                   0x00000000
#define _RPOR14_RP28R_MASK                       0x0000007F
#define _RPOR14_RP28R_LENGTH                     0x00000007

#define _RPOR14_RP29R_POSITION                   0x00000008
#define _RPOR14_RP29R_MASK                       0x00007F00
#define _RPOR14_RP29R_LENGTH                     0x00000007



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Fuses that are always present */

/* Register FBOOT (0x801800)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBOOT;
#define _FBOOT(x) __attribute__((address(0x801800),deprecated_definition("consider migrating to #pragma config"),section("__FBOOT.sec"),space(prog))) __prog__ uint16_t _FBOOT = (x);

/*
** Only one invocation of FBOOT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBOOT.
** Multiple options may be combined, as shown:
**
** _FBOOT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Mode Configuration bits:
**     BTMODE_DUALPROT      Device is in Dual Boot Protected mode
**     BTMODE_DUAL          Device is in Dual Boot mode
**     BTMODE_SINGLE        Device is in Single Boot (legacy) mode
**
*/

#define BTMODE_DUALPROT      0x0001
#define BTMODE_DUAL          0x0002
#define BTMODE_SINGLE        0x0003

/* Fuses that are only present in single panel mode */

#ifndef __DUAL_PARTITION
/* Register FSEC (0xabf00)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSEC;
#define _FSEC(x) __attribute__((address(0xabf00),deprecated_definition("consider migrating to #pragma config"),section("__FSEC.sec"),space(prog))) __prog__ uint16_t _FSEC = (x);

